text = "სანდრო კაკუტაშვილი, ირაკლი უგულავა, ლუკა კოხრეიძე, მათე მაისურაძე, გიორგი სხირტლაძე, მარიამ წულუკიძე, ლუკა დავითაშვილი, სანდრო შენგელია, ნიკოლოზ ჯაფარიძე, გიორგი მენთეშაშვილი, დანიელ ჯავახიძე, ლუკა ქიტიაშვილი, გიორგი უძილაური, რეზი ხარებავა, გურიკა გელხაური, გიორგი ჩიგვინაძე, ჯაბა ბეგიაშვილი, ლუკა ბარამიძე, საბა ყურაშვილი, ალექსანდრე წოწკოლაური, თოკო ბუსკივაძე, გიორგი ჩიხელიძე, საბა ხურციძე, ლიკა ჭიკაიძე."
text = text.replace(",", " ").split()
sir_names = []
for index in range (len(text)):
    if index % 2 != 0:
        sir_names.append(text[index])
print(sir_names)